Revit 2024 API
NumberingSchemaType Constructor
Creates a new NumberingSchemaType instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public NumberingSchemaType(
	Guid guid
)
Visual Basic
Public Sub New ( _
	guid As Guid _
)
Visual C++
public:
NumberingSchemaType(
	Guid guid
)
Parameters
guid
Type: System.Guid
The identifier for the NumberingSchemaType.
See Also
NumberingSchemaType Class
Autodesk.Revit.DB Namespace